###  Part # 2
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  e                             = "prod"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0887474d34bab8da2"
      + tags                                 = {
          + "App"   = "Web"
          + "Name"  = "prod-Amazon-Linux-Private"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + tags_all                             = {
          + "App"   = "Web"
          + "Name"  = "prod-Amazon-Linux-Private"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web_sg will be created
  + resource "aws_security_group" "web_sg" {
      + arn                    = (known after apply)
      + description            = "Allow SSH inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App"   = "Web"
          + "Name"  = "prod-SG-Private-nonprod"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + tags_all               = {
          + "App"   = "Web"
          + "Name"  = "prod-SG-Private-nonprod"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + vpc_id                 = "vpc-0c69cecb527543d4f"
    }

  # aws_security_group.web_sg_public will be created
  + resource "aws_security_group" "web_sg_public" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and SSH inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from everywhere"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from everywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_http_ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App"   = "Web"
          + "Name"  = "prod-SG-Public-nonprod"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + tags_all               = {
          + "App"   = "Web"
          + "Name"  = "prod-SG-Public-nonprod"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + vpc_id                 = "vpc-0c69cecb527543d4f"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ web_sg_public = "sg-0b52e7de038ae29cc" -> (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.acs730-webserver[0] has been deleted%0A  - resource "aws_instance" "acs730-webserver" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-04e6f260ae2691e8e" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1a" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-04e6f260ae2691e8e" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-03e799d29cf9bd3ed" -> null%0A      - private_dns                          = "ip-10-1-1-47.ec2.internal" -> null%0A      - private_ip                           = "10.1.1.47" -> null%0A      - public_ip                            = "107.23.220.248" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-0b52e7de038ae29cc",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0165826815a681997" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerON"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerON"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0b52e7de038ae29cc",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0bb01777b4c7282a7" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[1] has been deleted%0A  - resource "aws_instance" "acs730-webserver" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0ed0c4d43f8f500e9" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1b" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0ed0c4d43f8f500e9" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-029149d15f63d495d" -> null%0A      - private_dns                          = "ip-10-1-2-58.ec2.internal" -> null%0A      - private_ip                           = "10.1.2.58" -> null%0A      - public_ip                            = "44.202.210.10" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-0b52e7de038ae29cc",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0332900edef97d833" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerON"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerON"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0b52e7de038ae29cc",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0256956bf42e1824e" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[2] has been deleted%0A  - resource "aws_instance" "acs730-webserver" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0694e9702a47f378e" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1c" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0694e9702a47f378e" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-0aa627ebfbd049a28" -> null%0A      - private_dns                          = "ip-10-1-3-238.ec2.internal" -> null%0A      - private_ip                           = "10.1.3.238" -> null%0A      - public_ip                            = "3.84.62.194" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-0b52e7de038ae29cc",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0521a65e64fb25f06" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerOFF"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerOFF"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0b52e7de038ae29cc",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0e3bfbb69ea080a9d" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[3] has been deleted%0A  - resource "aws_instance" "acs730-webserver" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-009d14f27ca0b008d" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1d" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-009d14f27ca0b008d" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-08208ef33e671248a" -> null%0A      - private_dns                          = "ip-10-1-4-248.ec2.internal" -> null%0A      - private_ip                           = "10.1.4.248" -> null%0A      - public_ip                            = "3.85.137.200" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-0b52e7de038ae29cc",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-01aeaf0cedbe71690" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerOFF"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerOFF"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0b52e7de038ae29cc",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0ddc6ff247f53cdaf" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.acs730gp[0] has been deleted%0A  - resource "aws_instance" "acs730gp" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0774966932e9a5329" -> null%0A      - associate_public_ip_address          = false -> null%0A      - availability_zone                    = "us-east-1a" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0774966932e9a5329" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-009035cc5deca5e0c" -> null%0A      - private_dns                          = "ip-10-1-5-148.ec2.internal" -> null%0A      - private_ip                           = "10.1.5.148" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-0d278c999303e2c30",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0f779bbad67539431" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Private"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Private"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0d278c999303e2c30",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-00f6a176555574263" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.acs730gp[1] has been deleted%0A  - resource "aws_instance" "acs730gp" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0b186aeb27b9c95fb" -> null%0A      - associate_public_ip_address          = false -> null%0A      - availability_zone                    = "us-east-1b" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0b186aeb27b9c95fb" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-0fdd93188ebcfc9b9" -> null%0A      - private_dns                          = "ip-10-1-6-154.ec2.internal" -> null%0A      - private_ip                           = "10.1.6.154" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-0d278c999303e2c30",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-05f310baa896e6ba4" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Private"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Private"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0d278c999303e2c30",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0515f43fe285e4e84" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_security_group.web_sg has been deleted%0A  - resource "aws_security_group" "web_sg" {%0A      - arn                    = "arn:aws:ec2:us-east-1:775273113262:security-group/sg-0d278c999303e2c30" -> null%0A      - description            = "Allow SSH inbound traffic" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0d278c999303e2c30" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = []%0A              - description      = ""%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = [%0A                  - "sg-0b52e7de038ae29cc",%0A                ]%0A              - self             = false%0A              - to_port          = 22%0A            },%0A        ] -> null%0A      - name                   = "allow_ssh" -> null%0A      - owner_id               = "775273113262" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-SG-Private-nonprod"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all               = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-SG-Private-nonprod"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id                 = "vpc-0eeeddeb6994aa7d7" -> null%0A    }%0A%0A  # aws_security_group.web_sg_public has been deleted%0A  - resource "aws_security_group" "web_sg_public" {%0A      - arn                    = "arn:aws:ec2:us-east-1:775273113262:security-group/sg-0b52e7de038ae29cc" -> null%0A      - description            = "Allow HTTP and SSH inbound traffic" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0b52e7de038ae29cc" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "HTTP from everywhere"%0A              - from_port        = 80%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 80%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "SSH from everywhere"%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A        ] -> null%0A      - name                   = "allow_http_ssh" -> null%0A      - owner_id               = "775273113262" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-SG-Public-nonprod"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all               = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-SG-Public-nonprod"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id                 = "vpc-0eeeddeb6994aa7d7" -> null%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.acs730-webserver[0] will be created%0A  + resource "aws_instance" "acs730-webserver" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = "subnet-08eb0761b285d4d99"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerON"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerON"%0A          + "env"   = "prod"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf"%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          + core_count       = (known after apply)%0A          + threads_per_core = (known after apply)%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[1] will be created%0A  + resource "aws_instance" "acs730-webserver" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = "subnet-0fcf07921dc8773b9"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerON"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerON"%0A          + "env"   = "prod"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf"%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          + core_count       = (known after apply)%0A          + threads_per_core = (known after apply)%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[2] will be created%0A  + resource "aws_instance" "acs730-webserver" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = "subnet-0fbfa6e5f68abc5a2"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerOFF"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerOFF"%0A          + "env"   = "prod"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          + core_count       = (known after apply)%0A          + threads_per_core = (known after apply)%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[3] will be created%0A  + resource "aws_instance" "acs730-webserver" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = "subnet-08c97493b0018f65f"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  =
  ```
  </details>
  *Pusher: @Gaurav-17, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*